In [6]:
import pandas as pd

In [10]:
df = pd.DataFrame(columns=['name', 'age', 'height'])
df

Empty DataFrame
Columns: [name, age, height]
Index: []

In [11]:
df.loc[0] = ['aaa', '10', '175']
df

  name age height
0  aaa  10    175

In [13]:
df.loc[1] = ['bbb', '10', '175']
df

  name age height
0  aaa  10    175
1  bbb  10    175

In [14]:
df['weight'] = ['60', '80']
df

  name age height weight
0  aaa  10    175     60
1  bbb  10    175     80

In [16]:
df.loc[3] = ['ggg', '10', '175', '55']
df

  name age height weight
0  aaa  10    175     60
1  bbb  10    175     80
3  ggg  10    175     55

In [17]:
df.loc[0] = ['fff', '10', '175', '55']
df

  name age height weight
0  fff  10    175     55
1  bbb  10    175     80
3  ggg  10    175     55

In [20]:
df.drop(['weight'], axis=1)

  name age height
0  fff  10    175
1  bbb  10    175
3  ggg  10    175

In [21]:
df

  name age height weight
0  fff  10    175     55
1  bbb  10    175     80
3  ggg  10    175     55

In [22]:
df = df.drop(['weight'], axis=1)
df

  name age height
0  fff  10    175
1  bbb  10    175
3  ggg  10    175

In [23]:
df.drop(3)

  name age height
0  fff  10    175
1  bbb  10    175

In [24]:
df

  name age height
0  fff  10    175
1  bbb  10    175
3  ggg  10    175

In [25]:
df = df.drop(3)
df

  name age height
0  fff  10    175
1  bbb  10    175

In [28]:
df['name'][0] = 'Allen'
df

    name age height
0  Allen  10    175
1    bbb  10    175

In [30]:
df['name'] = 'ggg'
df

  name age height
0  ggg  10    175
1  ggg  10    175

In [33]:
df.loc[0] = 'aaa'
df

  name  age height
0  aaa  aaa    aaa
1  ggg   10    175

In [35]:
df.to_csv(r'./pandas_practice.csv', index=0, encoding='utf-8')

In [36]:
df2 = pd.read_csv(r'./pandas_practice.csv')
df2

  name  age height
0  aaa  aaa    aaa
1  ggg   10    175

In [41]:
new_df = pd.DataFrame([['Allen', '22', '175'], ['Ted', '25', '180']], columns = ['name', 'age', 'height'])
new_df

    name age height
0  Allen  22    175
1    Ted  25    180

In [43]:
df.append(new_df)

    name  age height
0    aaa  aaa    aaa
1    ggg   10    175
0  Allen   22    175
1    Ted   25    180

In [44]:
df5 = df.append(new_df)
df5

    name  age height
0    aaa  aaa    aaa
1    ggg   10    175
0  Allen   22    175
1    Ted   25    180

In [45]:
df5.drop(0)

  name age height
1  ggg  10    175
1  Ted  25    180